[
    {
        "author": "Joseph Simonian (2024)",
        "title": "Computational Global Macro: Game Theory, Machine Learning, And Causal Inference",
        "url": "https://amzn.to/4g9gFex",
        "summary": "I believe that this book will quickly become an essential resource for strategic analysts seeking to move beyond speculative assessments of geopolitical risks and interactions. While common sense remains a foundational principle, the use of advanced quantitative tools can illuminate patterns and reveal new perspectives, offering valuable insights for informed decision-making.",
        "code_url": null
    },
    {
        "author": "Richard Sutton and Andrew Barto (2018)",
        "title": "Reinforcement Learning: An Introduction",
        "url": "http://incompleteideas.net/book/RLbook2020.pdf",
        "code_url": "http://incompleteideas.net/book/code/code2nd.html",
        "summary": "Teaser: Prologue to the first Edition. We first came to focus on what is now known as reinforcement learning in late 1979. We were both at the University of Massachusetts, working on one of the earliest projects to revive the idea that networks of neuronlike adaptive elements might prove to be a promising approach to artificial adaptive intelligence. The project explored the 'heterostatic theory of adaptive systems' developed by A. Harry Klopf. Harry/’s work was a rich source of ideas, and we were permitted to explore them critically and compare them with the long history of prior work in adaptive systems. Our task became one of teasing the ideas apart and understanding their relationships and relative importance. This continues today, but in 1979 we came to realize that perhaps the simplest of the ideas, which had long been taken for granted, had received surprisingly little attention from a computational perspective. This was simply the idea of a learning system that wants something, that adapts its behavior in order to maximize a special signal from its environment. This was the idea of a hedonistic learning system, or, as we would say now, the idea of reinforcement learning."
    },
    {
        "author": "Álvaro Cartea, Sebastian Jaimungal and Jose Penalva (2015)",
        "title": "Algorithmic and High-Frequency Trading",
        "url": "https://amzn.to/3PBwFuQ",
        "summary": "This book combines financial modelling, and practical applications, so you will learn from the start into top-notch financial frontiers. It is a most for learning trading strategies, you will get a really good look into algorithms ecosystems. I really recommend it.",
        "code_url": null
    },
    {
        "author": "Al Sweigart (2019)",
        "title": "Automate the Boring Stuff with Python, 2nd Edition",
        "url": "https://amzn.to/3PVzhUO",
        "summary": "You'll learn how to use Python to write programs that do in minutes what would take you hours to do by hand - no prior programming experience required. Once you've mastered the basics of programming, you'll create Python programs that effortlessly perform useful and impressive feats of automation. If you need the free book link (under a CC license), contact me.",
        "code_url": null
    },
    {
        "author": "Marc Peter Deisenroth, A. Aldo Faisal, Cheng Soon Ong (2020)",
        "title": "Mathematics for Machine Learning",
        "url": "https://t.co/rn9Xzh7mg1",
        "summary": "The URL will take you to a PDF free copy. This textbook introduces some essential mathematical concepts like linear algebra, matrix decompositions, probability, and optimization, in quite simple terms. It derives four key machine learning methods—linear regression, PCA, Gaussian mixture models, and support vector machines—using these concepts. It is suitable to first learners, as it focuses on building intuition and practical experience. The examples, exercises, and programming tutorials can be found on the book's website.",
        "code_url": null
    },
    {
        "author": "Dimitri P. Bertsekas (2017)",
        "title": "Dynamic Programming and Optimal Control",
        "url": "https://amzn.to/4az7Tpe",
        "summary": "Excellent introductory guide for everyone interested in dynamic programming, reinforcement learning and control theory. Chapter 6 was updated and includes more on one-step and multistep lookahead methods, parametric approximation architectures, neural networks, rollout, and Monte Carlo tree search. You can enhance the reading with lots of readily online materials.",
        "code_url": null
    },
        {
        "author": " Halsey Royden,  Patrick Fitzpatrick (Fourth Edition, 2010)",
        "title": "Real Analysis",
        "url": "https://amzn.to/4hhhBiw",
        "summary": "This is the last famous revision to a classic and rigorous textbook widely used for graduate-level study in real analysis. It provides a clear and structured introduction to measure theory, integration, and functional analysis, making it an essential resource for students and researchers alike. It builds a solid foundation in real analysis by starting with Lebesgue integration and exploring abstract spaces, paving the way for a deeper understanding of functional analysis. It culminates in the general theory of measure and integration, covering topics such as Lp spaces, Radon–Nikodym derivatives, and the Hahn–Banach theorem. Royden’s clear exposition, complemented by Fitzpatrick’s refinements, makes this text a little more accesible. If you need a (medium quality copy) for academic purpose, reach out to me.",
        "code_url": null
    },
    {
        "author": "Thomas H. Cormen, Charles E. Leiserson (Fourth Edition, 2022)",
        "title": "Introduction to Algorithms",
        "url": "https://amzn.to/424YnYC",
        "summary": "Comprehensive guide to truly understand algorithms, quite known and very appreciated. The new edition includes new chapters on bipartite graph matchings, online algorithms, and machine learning. It also features new exercises and problems as well as recurrence equations, hash tables, and suffix arrays. Nice pseudocode and self-contained chapters, this book balances depth and accessibility, making it an awesome resource for both academics and professionals.",
        "code_url": null
    },
        {
        "author": "Allen B. Downey (2021)",
        "title": "Data Structures and Information Retrieval in Python",
        "url": "https://allendowney.github.io/DSIRP/#",
        "summary": "This is a hands-on resource to learn algorithms and information retrieval using Python. It uses a search engine as example, exploring the Crawler, Indexer, and the Retriever, with each data structure first presented in Python, then in Redis. runs in Colab!",
        "code_url": null
    }
]
