[
    {
        "author": "Meta AI, Dan Bikel et al. (2024)",
        "title": "Llama 2: Open Foundation and Fine-Tuned Chat Models",
        "url": "https://ai.meta.com/research/publications/llama-2-open-foundation-and-fine-tuned-chat-models/",
        "abstract": "...we develop and release Llama 2, a collection of pretrained and fine-tuned large language models (LLMs) ranging in scale from 7 billion to 70 billion parameters. Our fine-tuned LLMs, called Llama 2-Chat, are optimized for dialogue use cases. Our models outperform open-source chat models on most benchmarks we tested, and based on our human evaluations for helpfulness and safety, may be a suitable substitute for closedsource models. We provide a detailed description of our approach to fine-tuning and safety improvements of Llama 2-Chat in order to enable the community to build on our work and contribute to the responsible development of LLMs.",
        "code_url": null
    },
          {
        "author": "Masamitsu Ohnishi and Makoto Shimoshimitsu (2024)",
        "title": "Trade execution games in a Markovian environment",
        "url": "http://dx.doi.org/10.2139/ssrn.4818028",
        "abstract": "This paper examines a trade execution game for two large traders in a generalized price impact model. We incorporate a stochastic and sequentially dependent factor that exogenously affects the market price into financial markets. Our model accounts for how strategic and environmental uncertainties affect the large traders’ execution strategies. We formulate an expected utility maximization problem for two large traders as a Markov game model. Applying the backward induction method of dynamic programming, we provide an explicit closed-form execution strategy at a Markov perfect equilibrium. Our theoretical results reveal that the execution strategy generally lies in a dynamic and non-randomized class; it becomes deterministic if the Markovian environment is also deterministic. In addition, our simulation-based numerical experiments suggest that the execution strategy captures various features observed in financial markets.",
        "code_url": null
    },
    {
        "author": "Adamantios Ntakaris et al. (2017)",
        "title": "Benchmark Dataset for Mid-Price Forecasting of Limit Order Book Data with Machine Learning Methods",
        "url": "https://arxiv.org/abs/1705.03233",
        "abstract": "Managing the prediction of metrics in high-frequency financial markets is a challenging task. An efficient way is by monitoring the dynamics of a limit order book to identify the information edge. This paper describes the first publicly available benchmark dataset of high-frequency limit order markets for mid-price prediction. We extracted normalized data representations of time series data for five stocks from the NASDAQ Nordic stock market for a time period of ten consecutive days, leading to a dataset of ~4,000,000 time series samples in total. A day-based anchored cross-validation experimental protocol is also provided that can be used as a benchmark for comparing the performance of state-of-the-art methodologies. Performance of baseline approaches are also provided to facilitate experimental comparisons. We expect that such a large-scale dataset can serve as a testbed for devising novel solutions of expert systems for high-frequency limit order book data analysis.",
        "code_url": null
    },
    {
        "author": "Gbenga Ibikunle, Seth Armitage, James Clunie (2016)",
        "title": "The Cost of Trading from the Fund Manager's Perspective",
        "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2836070",
        "abstract": "The cost of executing orders could differ from the cost of trades. We estimate the cost of a fund manager’s orders to trade in shares and contracts for differences (CFDs), using data for 2013-15. We compare directly the effective half-spread (EHS) of an order with the EHS that would be inferred using market data, namely the average EHS of trades in the relevant share, and the quoted half-spread. The typical EHS of an order is approximately same as the cost inferred from market data, while the typical cost of CFDs is slightly higher. However, there is wide variation in the cost of orders, and about one third have a negative spread. The cost of orders by value exceeds the inferred cost, mainly because of a small percentage of orders with very large spreads.",
        "code_url": null
    },
    {
        "author": "Rónán Gallagher (2020)",
        "title": "The evolving relation between dividends and flexible payouts: A different evolution",
        "url": "https://onlinelibrary.wiley.com/doi/full/10.1111/eufm.12288",
        "abstract": "We study payout by UK listed companies during 1993–2018. Regular dividends remain the dominant channel, but flexible payouts (special dividends and repurchases) have grown, and they make total payout more responsive to earnings. Flexible payouts are used to augment regular dividends: few companies pay out by flexible means only, and tests indicate that they augment rather than replace regular dividends. Comparison with US evidence shows that UK companies make greater use of dividends (including specials) in relation to repurchases, and have a greater willingness to change regular dividend per share.",
        "code_url": null
    },
    {
        "author": "Taylor Spears (2023)",
        "title": "The use and promises of Machine Learning in financial markets: From mundane practices to complex automated system",
        "url": "https://doi.org/10.1093/oxfordhb/9780197653609.013.6",
        "abstract": "...we examine the use of machine learning (ML) in financial markets and argue that the adoption of ML into finance is bringing to light new issues that have traditionally fallen outside the purview of the sociology of finance and financial modelling. While quantitative models have traditionally been used in a relatively narrow set of contexts within financial organizations, ML adoption has occurred rapidly on the periphery of the trading floor. The use of ML in more mundane areas of finance creates opportunities for sociologists interested in financial modelling to engage with scholarly work from related fields, such as critical algorithm studies and international political economy. Furthermore, we argue that the use of ML methods may be facilitating a cultural and infrastructural alignment between Big Tech and financial services both through the adoption of open source software within finance and the dependence of ML on large-scale cloud infrastructures. Accordingly, we identify two potential directions for future work on the sociology of financial machine learning: a horizontal expansion to account for the ways machine learning is being used across financial institutions, and a vertical deepening that investigates the infrastructures upon which ML systems are developed and deployed, and how they are shaping financial institutions and markets.",
        "code_url": null
    },
    {
        "author": "Richard Sutton and Andrew Barto (2018)",
        "title": "Reinforcement Learning: An Introduction",
        "url": "http://incompleteideas.net/book/RLbook2020.pdf",
        "code_url": "http://incompleteideas.net/book/code/code2nd.html",
        "abstract": "Teaser: Prologue to the first Edition. We first came to focus on what is now known as reinforcement learning in late 1979. We were both at the University of Massachusetts, working on one of the earliest projects to revive the idea that networks of neuronlike adaptive elements might prove to be a promising approach to artificial adaptive intelligence. The project explored the 'heterostatic theory of adaptive systems' developed by A. Harry Klopf. Harry/’s work was a rich source of ideas, and we were permitted to explore them critically and compare them with the long history of prior work in adaptive systems. Our task became one of teasing the ideas apart and understanding their relationships and relative importance. This continues today, but in 1979 we came to realize that perhaps the simplest of the ideas, which had long been taken for granted, had received surprisingly little attention from a computational perspective. This was simply the idea of a learning system that wants something, that adapts its behavior in order to maximize a special signal from its environment. This was the idea of a hedonistic learning system, or, as we would say now, the idea of reinforcement learning."
    },
    {
        "author": "Álvaro Cartea et al. (2024)",
        "title": "Statistical Predictions of Trading Strategies in Electronic Markets",
        "url": "https://dx.doi.org/10.2139/ssrn.4442770",
        "abstract": "We build statistical models to describe how market participants choose the direction, price, and volume of orders. Our dataset, which spans sixteen weeks for four shares traded in Euronext Amsterdam, contains all messages sent to the exchange and includes algorithm identification and member identification. We obtain reliable out-of-sample predictions and report the top features that predict direction, price, and volume of orders sent to the exchange. The coefficients from the fitted models are used to cluster trading behaviour and we find that algorithms registered as Liquidity Providers exhibit the widest range of trading behaviour among dealing capacities. In particular, for the most liquid share in our study, we identify three types of behaviour that we call (i) directional trading, (ii) opportunistic trading, and (iii) market making, and we find that around one third of Liquidity Providers behave as market markers.",
        "code_url": null
    },
    {
        "author": "Álvaro Cartea, Sebastian Jaimungal and Jose Penalva (2015)",
        "title": "Algorithmic and High-Frequency Trading",
        "url": "https://amzn.to/3PBwFuQ",
        "abstract": "This book combines financial modelling, and practical applications, so you will learn from the start into top-notch financial frontiers. It is a most for learning trading strategies, you will get a really good look into algorithms ecosystems. I really recommend it.",
        "code_url": null
    },
    {
        "author": "Thomas H. Cormen, Charles E. Leiserson (Fourth Edition, 2022)",
        "title": "Introduction to Algorithms",
        "url": "https://amzn.to/424YnYC",
        "abstract": "Comprehensive guide to truly understand algorithms, quite known and very appreciated. The new edition includes new chapters on bipartite graph matchings, online algorithms, and machine learning. It also features new exercises and problems as well as recurrence equations, hash tables, and suffix arrays. Nice pseudocode and self-contained chapters, this book balances depth and accessibility, making it an awesome resource for both academics and professionals.",
        "code_url": null
    },
    {
        "author": "Rodolfo Sosa-Garcia (2008)",
        "title": "Democracy: Freedom and Capitalism",
        "url": "https://www.researchgate.net/publication/228283745_Democracy_Freedom_and_Capitalism",
        "abstract": "Democracy (including freedom) is confronting various internal threats, among them the lack of quality of laws; but also they are confronting various external threats, such as terrorism. The paper analyzes Democracy in a broad use based on the concepts of Freedom and Capitalism.",
        "code_url": null
    }
]
